FOAM-420/applications/test/volField/cavity/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=Test-volField

# Compile
runApplication wmake ..

runApplication blockMesh

runApplication $application

#------------------------------------------------------------------------------
